app/controllers/comments_controller.rb

   def create
     @comment = Comment.create(text: params[:text],tweet_id: params[:tweet_id],user_id: current_user.id)
---
INSERT INTO `comments` (`text`, `tweet_id`, `user_id`, `created_at`, `updated_at`) VALUES ('そうですね\r\n', 5, 1, '2016-10-22 04:57:25', '2016-10-22 04:57:25')