app/controllers/tweets_controller.rb

 def index
  @tweets = Tweet.includes(:user).order("created_at DESC").page(params[:page]).per(5)
---
SELECT  `tweets`.* FROM `tweets`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1)

def create
  Tweet.create(image: tweet_params[:image], text: tweet_params[:text], user_id: current_user.id)
---
INSERT INTO `tweets` (`name`, `image`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('そーた', 'https://tech-master.s3.amazonaws.com/uploads/curriculums/images/Rails1-6/008.jpg', 'プログラミング楽しい\r\n', 2, '2016-10-17 11:58:54', '2016-10-17 11:58:54')

def destroy
 tweet = Tweet.find(params[:id])
 tweet.destroy if tweet.user_id == current_user.id
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 3 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 3

def update
  tweet = Tweet.find(params[:id])
  if tweet.user_id == current_user.id
    tweet.update(tweet_params)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 2 LIMIT 1
UPDATE `tweets` SET `text` = 'テクキャンプわず　\r\n', `updated_at` = '2016-10-20 06:11:02' WHERE `tweets`.`id` = 2